-- MySQL dump 10.14  Distrib 5.5.68-MariaDB, for Linux (x86_64)
--
-- Host: localhost    Database: 1_IPP
-- ------------------------------------------------------
-- Server version	5.5.68-MariaDB

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `LOG`
--

DROP TABLE IF EXISTS `LOG`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `LOG` (
  `log_id` int(11) NOT NULL,
  `log_date` date NOT NULL,
  `log_result` varchar(10) DEFAULT NULL,
  `log_if_table` varchar(10) NOT NULL,
  `log_step` varchar(10) NOT NULL,
  `log_err_code` varchar(3) NOT NULL,
  PRIMARY KEY (`log_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `LOG`
--

LOCK TABLES `LOG` WRITE;
/*!40000 ALTER TABLE `LOG` DISABLE KEYS */;
INSERT INTO `LOG` VALUES (32,'2022-06-02','info','교수','전송완료','-'),(41,'2022-06-03','info','수강','전송완료','-'),(90,'2022-06-06','info','학생','전송완료','-'),(225,'2022-06-06','info','학생','전송완료','-'),(257,'2022-06-03','info','수강','생성완료','-'),(299,'2022-06-02','info','수강','생성완료','-'),(349,'2022-06-02','info','학생','생성완료','-'),(424,'2022-06-06','info','수강','생성완료','-'),(441,'2022-06-02','info','강의실','생성완료','-'),(458,'2022-06-03','info','교과목','생성완료','-'),(582,'2022-06-03','info','수강','생성완료','-'),(591,'2022-06-06','info','교수','생성완료','-'),(675,'2022-06-03','info','학생','생성완료','-'),(692,'2022-06-06','info','강의실','전송완료','-'),(711,'2022-06-03','info','과목','전송완료','-'),(726,'2022-06-06','info','교과목','생성완료','-'),(753,'2022-06-06','info','강의실','생성완료','-'),(781,'2022-06-03','info','수강','생성완료','-'),(829,'2022-06-02','info','강의실','생성완료','-'),(847,'2022-06-02','info','강의실','생성완료','-'),(1113,'2022-06-06','info','교수','생성완료','-'),(1229,'2022-06-06','info','강의실','전송완료','-'),(1230,'2022-06-06','error','강의실','전송시오류','ERD'),(1392,'2022-06-03','info','학생','전송완료','-'),(1488,'2022-06-06','info','교수','전송완료','-'),(1564,'2022-06-06','info','수강','전송완료','-'),(1632,'2022-06-06','info','학과','생성완료','-'),(1647,'2022-06-02','info','교수','생성완료','-'),(1653,'2022-06-06','info','학과','생성완료','-'),(1738,'2022-06-03','info','교과목','생성완료','-'),(1835,'2022-06-06','info','학생','전송완료','-'),(1858,'2022-06-06','info','강의실','생성완료','-'),(1904,'2022-06-03','info','학과','생성완료','-'),(1911,'2022-06-06','info','교과목','생성완료','-'),(2043,'2022-06-02','info','교수','생성완료','-'),(2078,'2022-06-06','info','수강','생성완료','-'),(2206,'2022-06-02','info','학과','생성완료','-'),(2313,'2022-06-06','info','과목','전송완료','-'),(2392,'2022-06-02','info','수강','전송완료','-'),(2399,'2022-06-02','info','과목','전송완료','-'),(2420,'2022-06-03','info','교수','생성완료','-'),(2461,'2022-06-02','info','학과','생성완료','-'),(2525,'2022-06-06','info','교수','전송완료','-'),(2716,'2022-06-06','info','강의실','전송완료','-'),(2764,'2022-06-02','info','교수','생성완료','-'),(3030,'2022-06-03','info','학과','생성완료','-'),(3131,'2022-06-06','info','강의실','생성완료','-'),(3219,'2022-06-06','info','강의실','전송완료','-'),(3252,'2022-06-06','info','강의실','전송완료','-'),(3446,'2022-06-02','info','강의실','전송완료','-'),(3453,'2022-06-06','info','과목','전송완료','-'),(3468,'2022-06-06','info','학생','생성완료','-'),(3478,'2022-06-06','info','수강','생성완료','-'),(3490,'2022-06-03','info','교과목','생성완료','-'),(3500,'2022-06-06','info','교수','전송완료','-'),(3558,'2022-06-06','info','교과목','생성완료','-'),(3609,'2022-06-06','info','학생','생성완료','-'),(3612,'2022-06-06','info','과목','전송완료','-'),(3778,'2022-06-03','info','교수','생성완료','-'),(3796,'2022-06-02','info','과목','전송완료','-'),(3935,'2022-06-03','info','수강','생성완료','-'),(4101,'2022-06-06','info','교과목','생성완료','-'),(4234,'2022-06-06','info','교과목','생성완료','-'),(4236,'2022-06-03','info','학생','전송완료','-'),(4522,'2022-06-06','info','수강','생성완료','-'),(4532,'2022-06-06','info','강의실','생성완료','-'),(4592,'2022-06-06','info','학생','전송완료','-'),(4724,'2022-06-06','info','학과','생성완료','-'),(4762,'2022-06-03','info','학과','생성완료','-'),(4785,'2022-06-06','info','강의실','생성완료','-'),(4942,'2022-06-06','info','교수','생성완료','-'),(4964,'2022-06-06','info','수강','전송완료','-'),(5018,'2022-06-03','info','강의실','생성완료','-'),(5032,'2022-06-02','info','강의실','전송완료','-'),(5049,'2022-06-03','info','수강','전송완료','-'),(5085,'2022-06-06','info','수강','전송완료','-'),(5123,'2022-06-06','info','교수','전송완료','-'),(5144,'2022-06-03','info','학과','생성완료','-'),(5169,'2022-06-03','info','교수','전송완료','-'),(5328,'2022-06-03','info','교수','생성완료','-'),(5415,'2022-06-06','info','강의실','생성완료','-'),(5456,'2022-06-06','info','학과','생성완료','-'),(5532,'2022-06-06','info','학과','생성완료','-'),(5642,'2022-06-06','info','교수','생성완료','-'),(5799,'2022-06-06','info','학과','생성완료','-'),(5929,'2022-06-06','info','학과','생성완료','-'),(5938,'2022-06-06','info','강의실','생성완료','-'),(5976,'2022-06-02','info','교수','전송완료','-'),(6137,'2022-06-03','info','강의실','전송완료','-'),(6176,'2022-06-02','info','교과목','생성완료','-'),(6198,'2022-06-06','info','강의실','생성완료','-'),(6201,'2022-06-02','info','학생','생성완료','-'),(6438,'2022-06-06','info','교수','생성완료','-'),(6454,'2022-06-06','info','교수','생성완료','-'),(6524,'2022-06-06','info','교수','생성완료','-'),(6594,'2022-06-06','info','학생','생성완료','-'),(6680,'2022-06-02','info','학과','생성완료','-'),(6710,'2022-06-06','info','교수','전송완료','-'),(6757,'2022-06-06','info','학과','생성완료','-'),(6828,'2022-06-06','info','학생','전송완료','-'),(6953,'2022-06-06','info','교과목','생성완료','-'),(6956,'2022-06-02','info','학생','전송완료','-'),(7062,'2022-06-06','info','수강','전송완료','-'),(7074,'2022-06-06','info','강의실','생성완료','-'),(7239,'2022-06-02','info','학생','전송완료','-'),(7447,'2022-06-06','info','교과목','생성완료','-'),(7454,'2022-06-02','info','교과목','생성완료','-'),(7564,'2022-06-03','info','교수','생성완료','-'),(7694,'2022-06-06','info','수강','생성완료','-'),(7773,'2022-06-06','info','교수','생성완료','-'),(7796,'2022-06-02','info','수강','생성완료','-'),(7817,'2022-06-06','info','학생','생성완료','-'),(7820,'2022-06-06','info','수강','생성완료','-'),(7873,'2022-06-02','info','교수','생성완료','-'),(7874,'2022-06-03','info','강의실','생성완료','-'),(7884,'2022-06-02','info','강의실','생성완료','-'),(8044,'2022-06-02','info','수강','생성완료','-'),(8160,'2022-06-02','info','수강','생성완료','-'),(8202,'2022-06-03','info','강의실','생성완료','-'),(8317,'2022-06-03','info','교과목','생성완료','-'),(8342,'2022-06-06','info','수강','생성완료','-'),(8356,'2022-06-02','info','학과','생성완료','-'),(8406,'2022-06-06','info','수강','생성완료','-'),(8447,'2022-06-06','info','과목','전송완료','-'),(8448,'2022-06-03','info','학생','생성완료','-'),(8464,'2022-06-02','info','교과목','생성완료','-'),(8480,'2022-06-03','info','강의실','생성완료','-'),(8573,'2022-06-06','info','학과','생성완료','-'),(8600,'2022-06-03','info','교수','전송완료','-'),(8639,'2022-06-03','info','과목','전송완료','-'),(8840,'2022-06-06','info','강의실','생성완료','-'),(8957,'2022-06-06','info','교수','생성완료','-'),(9027,'2022-06-02','info','교과목','생성완료','-'),(9051,'2022-06-06','info','과목','전송완료','-'),(9140,'2022-06-03','info','강의실','전송완료','-'),(9247,'2022-06-06','info','수강','전송완료','-'),(9258,'2022-06-06','info','학생','생성완료','-'),(9325,'2022-06-06','info','학과','생성완료','-'),(9620,'2022-06-02','info','수강','전송완료','-'),(9799,'2022-06-06','info','교과목','생성완료','-'),(9838,'2022-06-06','info','교수','생성완료','-');
/*!40000 ALTER TABLE `LOG` ENABLE KEYS */;
UNLOCK TABLES;

/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2022-06-06 10:12:04